n02b3rt/PrintBack/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

# --- WiFi / sniffer plumbing ---------------------------------------------
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y

# --- System --------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_MBEDTLS_HARDWARE_SHA=y

# --- PrintBack: pinout (XIAO ESP32-C6) -----------------------------------
# D2=GPIO2 (tact), D3=GPIO21 (B), D4=GPIO22 (G), D5=GPIO23 (R)
CONFIG_PRINTBACK_PIN_BUTTON=2
CONFIG_PRINTBACK_PIN_LED_R=23
CONFIG_PRINTBACK_PIN_LED_G=22
CONFIG_PRINTBACK_PIN_LED_B=21

# Flip to =y if your RGB LED's long leg goes to 3V3 (common-anode).
CONFIG_PRINTBACK_LED_COMMON_ANODE=n

# --- PrintBack: tracker --------------------------------------------------
CONFIG_PRINTBACK_TRACKER_CAPACITY=1024
CONFIG_PRINTBACK_WINDOW_SECONDS=300
CONFIG_PRINTBACK_HOP_INTERVAL_MS=400
CONFIG_PRINTBACK_STATS_INTERVAL_SECONDS=30
CONFIG_PRINTBACK_RSSI_FLOOR=-85
CONFIG_PRINTBACK_JSON_OUTPUT=y

# --- PrintBack: whitelist capture ----------------------------------------
CONFIG_PRINTBACK_LONG_PRESS_MS=3000
CONFIG_PRINTBACK_ARMED_TIMEOUT_SECONDS=15
CONFIG_PRINTBACK_ARMED_RSSI_THRESHOLD=-45
